const quizQuestions = [
    {
        question: "ബി.ൻ.സ് സ് ൻറെ ഏതു അധ്യായമാണ് ക്രമസമാധാനവും ശാന്തതയും നിലനിർത്തലിനെ കുറിച്ച് വിശദീകരിക്കുന്നത്",
        options: ["അധ്യായം X", "അധ്യായം XI", "അധ്യായം IX", "അധ്യായം XII"],
        correct: 1
    },
    {
        question: "ഒരു ഗ്രാമത്തിന്റെ കാര്യങ്ങളുമായി ബന്ധപ്പെട്ട് നിയമിക്കപ്പെട്ടിരിക്കുന്ന ഓരോ ഉദ്യോഗസ്ഥനും അടുത്തുള്ള മജിസ്ട്രേറ്റിനെയോ അടുത്തുള്ള പോലീസ് സ്റ്റേഷൻ്റെ ചുമതലയുള്ള ഉദ്യോഗസ്ഥനെയോ താഴെ പറയുന്ന ചില വസ്‌തുതകളെ പറ്റി അറിയിക്കേണ്ടതാണ്. x. മോഷ്ടിച്ച വസ്‌തുക്കൾ വാങ്ങുകയോ വിൽക്കുകയോ ചെയ്യുന്ന കുപ്രസിദ്ധ വ്യക്തിയുടെ ഗ്രാമത്തിനകത്തോ അടുത്തോ ഉള്ള സ്ഥിരമോ താല്ക്കാലികമോ ആയ താമസസ്ഥലം. y. ഗ്രാമത്തിലെ സമീപത്തോ പെട്ടെന്നുള്ളതോ അസ്വാഭാവികമോ ആയ മരണം സംഭവിക്കുകയോ സംശയാസ്‌പദമായ സാഹചര്യത്തിൽ മരണം സംഭവിക്കുകയോ അല്ലെങ്കിൽ ഒരു ഗ്രാമത്തിലോ സമീപത്തോ ഏതെങ്കിലും മൃതദേഹമോ മൃതദേഹത്തിൻ്റെ ഭാഗമോ കണ്ടെത്തുകയോ ചെയ്യുക.",
        options: ["x മാത്രം", "y മാത്രം", "x ഉം y ഉം", "അറിയിക്കേണ്ടതില്ല"],
        correct: 2
    },
    {
        question: "ബിൻ സ് സ് ..... അറസ്റ്റ് ചെയ്യപ്പെട്ട വ്യക്തിയെ അറസ്റ്റിനുള്ള കാരണങ്ങളും ജാമ്യത്തിനുള്ള അവകാശവും അറിയിക്കേണ്ടതാണ്.",
        options: ["സെക്ഷൻ 47", "സെക്ഷൻ 49", "സെക്ഷൻ 50", "സെക്ഷൻ 51"],
        correct: 0
    },
    {
        question: "ഭാരതീയ നാഗരിക സുരക്ഷാ സംഹിത, 2023 പ്രകാരം സമൻസ് കൈപ്പറ്റേണ്ട വ്യക്തിയെ കണ്ടെത്താൻ കഴിയാത്ത സാഹചര്യത്തിൽ, പകരം സമൻസ് കൈപ്പറ്റാവുന്നത് ആർക്ക് ?",
        options: ["അദ്ദേഹത്തോടൊപ്പം താമസിക്കുന്ന കുടുംബത്തിലെ പ്രായപൂർത്തിയായ പുരുഷ അംഗത്തിന്", "അദ്ദേഹത്തോടൊപ്പം താമസിക്കുന്ന കുടുംബത്തിലെ പ്രായപൂർത്തിയായ അംഗത്തിന്", "അദ്ദേഹത്തോടൊപ്പം താമസിക്കുന്ന വേലക്കാരൻ ഉൾപ്പെടെ ഏതൊരു വ്യക്തിക്കും", "മറ്റാർക്കും കൈപ്പറ്റാൻ സാധിക്കില്ല"],
        correct: 1
    },
    {
        question: "ഭാരതീയ നാഗരിക് സുരക്ഷാ സംഹിതയിലെ സെക്ഷൻ 96 പ്രകാരം ഒരു സെർച്ച് വാറണ്ട് സാധുവായി തുടരുന്ന പരമാവധി കാലയളവ് എത്രയാണ് ?",
        options: ["ഏഴ് ദിവസം", "പതിനഞ്ച് ദിവസം", "മുപ്പത് ദിവസം", "പ്രത്യേക പരമാവധി കാലയളവ് പരാമർശിച്ചിട്ടില്ല"],
        correct: 3
    },
    {
        question: "ഭാരതീയ നാഗരിക് സുരക്ഷാ സംഹിത 2023 ലെ സെക്ഷൻ 40 (1) അനുസരിച്ച് ഒരു സ്വകാര്യ വ്യക്തിയാൽ അറസ്റ്റ് ചെയ്യപ്പെട്ട ആളെ എത്ര സമയപരിധിക്കുള്ളിൽ പോലീസ് ഉദ്യോഗസ്ഥന് കൈമാറണം !",
        options: ["6 മണിക്കൂറിനുള്ളിൽ", "12 മണിക്കൂറിനുള്ളിൽ", "24 മണിക്കൂറിനുള്ളിൽ", "ഇവയൊന്നുമല്ല"],
        correct: 0
    },
    {
        question: "ഭാരതീയ ന്യായ സുരക്ഷാ സംഹിത (BNSS) പ്രകാരം summons അയക്കാൻ അധികാരമുള്ളത് ആർക്കാണ്",
        options: ["പോലീസ് ഇൻസ്പെക്ടർ", "കോടതികൾ", "ജില്ലാ കലക്‌ടർ", "നിയമസഭാ സ്പീക്കർ"],
        correct: 1
    },
    {
        question: "BNSS 168-172 വകുപ്പുകൾ പ്രകാരമുള്ള നടപടികളുടെ പ്രധാന ലക്ഷ്യം എന്താണ് ?",
        options: ["കോടതിയുടെ അധികാരങ്ങൾ കുറയ്ക്കുക", "കുറ്റകൃത്യം സംഭവിക്കാതെ തടയുക", "ജാമ്യം നിഷേധിക്കാൻ വഴി ഒരുക്കുക", "വാറണ്ട് ഇല്ലാതെ അറസ്റ്റ് സാധ്യമാവുക"],
        correct: 1
    },
    {
        question: "(BNSS) പ്രകാരം പോലീസ് എഫ്.ഐ.ആർ രജിസ്റ്റർ ചെയ്യേണ്ടത് എത്ര സമയത്തിനുള്ളിൽ",
        options: ["7 ദിവസത്തിനുള്ളിൽ", "ഉടൻ തന്നെ", "24 മണിക്കൂറിനുള്ളിൽ", "മേധാവിയുടെ അനുമതിക്കു ശേഷം"],
        correct: 1
    },
    {
        question: "BNSS പ്രകാരം കുറ്റസമ്മതം സംബന്ധിച്ച് ശരിയായ പ്രസ്താവന ഏത്",
        options: ["മജിസ്ട്രേറ്റിന് മുന്നിൽ മാത്രമേ കുറ്റസമ്മതം രേഖപ്പെടുത്താവു", "പോലീസ് ഓഫീസറിനു മുമ്പാകെ കുറ്റസമ്മതം രേഖപ്പെടുത്താം", "(a) or (b)", "ഇവയൊന്നുമല്ല"],
        correct: 0
    },
    {
        question: "അന്വേഷണ സമയത്ത് വാറൻ്റില്ലാതെ സെർച്ച് നടത്താവുന്ന ഉദ്യോഗസ്ഥൻ",
        options: ["ഏതെങ്കിലും പോലീസ് ഉദ്യോഗസ്ഥൻ", "അന്വേഷണ ഉദ്യോഗസ്ഥന്റ", "(a) & (b)", "(a) or (b)"],
        correct: 1
    },
    {
        question: "ഒരു കോനൈസബിൾ കേസ് പോലീസ് രജിസ്റ്റർ ചെയ്യുന്നതുമായി ബന്ധപ്പെട്ട BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 152", "സെക്ഷൻ 173", "സെക്ഷൻ 160", "സെക്ഷൻ 176"],
        correct: 1
    },
    {
        question: "ഒരു കേസ് അന്വേഷിക്കുന്ന പോലീസ് ഉദ്യോഗസ്ഥന് കേസിൻ്റെ വിവരങ്ങൾ അറിയാവുന്ന ഒരു വ്യക്തിയെ ഹാജരാക്കാൻ അധികാരം നൽകുന്ന BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 74", "സെക്ഷൻ 179", "സെക്ഷൻ 200", "സെക്ഷൻ 154"],
        correct: 1
    },
    {
        question: "ഇന്ത്യയിലെ ഒരു മജിസ്ട്രേറ്റ് പുറപ്പെടുവിച്ച വാറൻ്റ് ഇന്ത്യയിലെവിടെയും വച്ച് നടപ്പിലാക്കാം എന്ന് അനുശാസിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 41", "സെക്ഷൻ 52", "സെക്ഷൻ 79", "സെക്ഷൻ 101"],
        correct: 2
    },
    {
        question: "BNS ന്റെ കീഴിൽ വരുന്ന കോനൈസബിൾ കുറ്റങ്ങളെ നിർവചിച്ചിരിക്കുന്ന സെക്ഷൻ",
        options: ["സെക്ഷൻ 2(1)(g)", "സെക്ഷൻ 2(1)(a)", "സെക്ഷൻ 2(1)(b)", "സെക്ഷൻ 2 (1)(d)"],
        correct: 0
    },
    {
        question: "ഏതുതരം കുറ്റകൃത്യങ്ങളാണ് BNSS ൽ പ്രതിപാദിച്ചിരിക്കുന്നത്",
        options: ["കോനൈസബിൾ & നോൺകോനൈസബിൾ", "ബെയിലബിൾ & നോൺ ബെയിലബിൾ", "സമൻസ് കേസ് & വാറന്റ് കേസ്", "ഇവയെല്ലാം"],
        correct: 3
    },
    {
        question: "BNS ന്റെ കീഴിൽ വരുന്ന ഒരു കോനൈസബിൾ കേസിൽ പോലീസിന്",
        options: ["കുറ്റവാളിയെ വാറൻ്റില്ലാതെ അറസ്റ്റ് ചെയ്യാം", "മജിസ്ട്രേറ്റിൻ്റെ അനുമതിയില്ലാതെ കേസ് അന്വേഷണം നടത്താം", "A & B", "A or B"],
        correct: 2
    },
    {
        question: "നോൺ കോഗ്നൈസബിൾ കേസുകളുടെ നിർവചനം ഉൾക്കൊള്ളുന്ന BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 3 (i)", "സെക്ഷൻ 2(1)(f)", "സെക്ഷൻ 2(1)(o)", "സെക്ഷൻ 4 (i)"],
        correct: 2
    },
    {
        question: "അറസ്റ്റിനെ സംബന്ധിച്ച് ശരിയല്ലാത്ത പ്രസ്താവന ഏത് ?",
        options: ["പോലീസ് ഉദ്യോഗസ്ഥർക്ക് മാത്രമാണ് ഒരാളെ അറസ്റ്റ് ചെയ്യാവുന്നത്", "കസ്റ്റഡിക്ക് കീഴ്പ്പെടാത്ത വ്യക്തിക്കെതിരെ ആവശ്യമായ ബലം പ്രയോഗിക്കാവുന്നതാണ്.", "സ്ത്രീയെ അറസ്റ്റ് ചെയ്യുന്ന ഒരു പുരുഷ ഉദ്യോഗസ്ഥൻ അവരുടെ ശരീരത്തിൽ സ്പർശിക്കരുത്", "ഇവയൊന്നുമല്ല"],
        correct: 0
    },
    {
        question: "ഒരു അറസ്റ്റ് വാറന്റ് എന്നത്",
        options: ["ഒരു ലിഖിതമായ രേഖയായിരിക്കണം", "സീലും ഒപ്പോടുകൂടി ഒരു മജിസ്ട്രേറ്റ് പുറപ്പെടുവിക്കണം", "ഒരു പോലീസ് ഓഫീസർക്ക് അഭിസംബോധന ചെയ്യപ്പെട്ടതായിരിക്കണം", "ഇവയെല്ലാം"],
        correct: 3
    },
    {
        question: "വാറന്റില്ലാതെ അറസ്റ്റു ചെയ്‌ത ഒരു വ്യക്തിയെ 24 മണിക്കൂറിനുള്ളിൽ ഒരു മജിസ്ട്രേറ്റിനു മുന്നിൽ ഹാജരാക്കണമെന്ന് അനുശാസിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 56", "സെക്ഷൻ 58", "സെക്ഷൻ 59", "സെക്ഷൻ 60"],
        correct: 1
    },
    {
        question: "കോഡ് ഓഫ് ക്രിമിനൽ പ്രൊസീജിയർ നിലവിൽ വന്ന വർഷം",
        options: ["1974 ഏപ്രിൽ 1", "1973 ഏപ്രിൽ 1", "1974 മെയ് 1", "1976 ജനുവരി 1"],
        correct: 0
    },
    {
        question: "പോലീസ് ഒരു വ്യക്തിയെ വാറൻ്റില്ലാതെ അറസ്റ്റ് ചെയ്യുന്ന സന്ദർഭങ്ങൾ വിശദമാക്കുന്ന BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 36", "സെക്ഷൻ 35", "സെക്ഷൻ 38", "സെക്ഷൻ 77"],
        correct: 1
    },
    {
        question: "ഒരു വാറന്റ്റ് കേസ് എന്നാൽ",
        options: ["ജീവപര്യന്തം തടവുശിക്ഷ ലഭിക്കാവുന്ന കുറ്റം", "വധശിക്ഷ ലഭിക്കാവുന്ന കുറ്റം", "രണ്ടുവർഷത്തിൽ കൂടുതൽ തടവുശിക്ഷ ലഭിക്കാവുന്ന കുറ്റം", "ഇവയെല്ലാം"],
        correct: 3
    },
    {
        question: "24 മണിക്കൂറിനകം പോലീസിന് അന്വേഷണം പൂർത്തിയാക്കാൻ കഴിയാതെ വരുന്ന സന്ദർഭങ്ങളിൽ ഒരു മജിസ്ട്രേറ്റിന് പ്രതിയെ .... ദിവസത്തിൽ കവിയാത്ത കാലാവധിക്ക് അപ്പപ്പോഴായി കസ്റ്റഡിയിൽ വയ്ക്കാൻ അനുവാദം നൽകാവുന്നതാണ്.",
        options: ["10 ദിവസം", "15 ദിവസം", "25 ദിവസം", "30 ദിവസം"],
        correct: 1
    },
    {
        question: "തന്നിരിക്കുന്നവരിൽ BNSS പ്രകാരം ഒരാളെ അറസ്റ്റ് ചെയ്യാൻ അധികാരമുള്ള വ്യക്തി",
        options: ["സ്വകാര്യ വ്യക്തി", "ജുഡീഷ്യൽ മജിസ്ട്രേറ്റ്", "എക്സിക്യൂട്ടീവ് മജിസ്ട്രേറ്റ്", "ഇവരെല്ലാം"],
        correct: 3
    },
    {
        question: "ഒരു വ്യക്തി .... വയസ്സിൽ താഴെയുള്ളതാണെങ്കിൽ പോലീസിന് അയാളെ ഒരു കേസിന് സാക്ഷിയായി എവിടെയെങ്കിലും ഹാജരാകണമെന്ന് ആവശ്യപ്പെടാൻ പാടില്ല",
        options: ["15 വയസ്സ്", "16 വയസ്സ്", "18 വയസ്സ്", "21 വയസ്സ്"],
        correct: 0
    },
    {
        question: "സമൻസ് ലഭിച്ചിട്ടും മനഃപൂർവം കോടതി മുമ്പാകെ ഹാജരാകാൻ വിസമ്മതിക്കുന്ന വ്യക്തികൾക്കെതിരെ കോടതി പുറപ്പെടുവിക്കുന്ന ഉത്തരവ്",
        options: ["മെമ്മോ", "ഇൻഡന്റ്", "വാറൻ്റ്", "ബെയ്ൽ"],
        correct: 2
    },
    {
        question: "BNSS 187 പ്രകാരം ഒരു എക്സിക്യൂട്ടീവ് മജിസ്ട്രേറ്റിന് ഒരു പ്രതിയെ എത്ര കാലത്തേക്ക് റിമാന്റ് ചെയ്യാനുള്ള അനുമതി നൽകാവുന്നതാണ്",
        options: ["3 ദിവസം", "5 ദിവസം", "7 ദിവസം", "10 ദിവസം"],
        correct: 2
    },
    {
        question: "മജിസ്ട്രേറ്റിന് ഒരു പ്രതിയെ അറസ്റ്റ് ചെയ്യാം എന്ന് അനുശാസിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 41", "സെക്ഷൻ 43", "സെക്ഷൻ 67", "സെക്ഷൻ 47"],
        correct: 0
    },
    {
        question: "BNSS നിയമപ്രകാരം പോലീസിനു നിക്ഷിപ്തമായിരിക്കുന്ന അധികാരം ഉപയോഗിച്ച് പ്രതികളെ ചോദ്യം ചെയ്യുന്നതിന് ഹാജരാകണമെന്ന് കാണിച്ചു നോട്ടീസ് നൽകുന്ന വകുപ്പ്",
        options: ["സെക്ഷൻ 41", "സെക്ഷൻ 41(A)", "സെക്ഷൻ 41(B)", "സെക്ഷൻ 41(D)"],
        correct: 1
    },
    {
        question: "BNSS നിയമപ്രകാരം സമൻസ് നടത്തുന്നത് എങ്ങനെയാണെന്നതിനെക്കുറിച്ച് പരാമർശിക്കുന്ന സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 64", "സെക്ഷൻ 66", "സെക്ഷൻ 74", "സെക്ഷൻ 72"],
        correct: 0
    },
    {
        question: "BNSS നിയമപ്രകാരം കേസിലെ സാക്ഷികളെ പോലീസിനു വിസ്‌തരിക്കുവാനുള്ള അധികാരം നൽകുന്ന സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 160", "സെക്ഷൻ 180", "സെക്ഷൻ 194", "സെക്ഷൻ 183"],
        correct: 1
    },
    {
        question: "BNSS നിയമപ്രകാരം അസ്വാഭാവിക മരണത്തെക്കുറിച്ച് പോലീസ് കേസ് രജിസ്റ്റർ ചെയ്‌ത്‌ അന്വേഷിക്കുന്നതിനുള്ള അധികാരം നൽകുന്ന സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 194", "സെക്ഷൻ 197", "സെക്ഷൻ 198", "സെക്ഷൻ 199"],
        correct: 0
    },
    {
        question: "അന്വേഷണം 24 മണിക്കൂറിനകം പൂർത്തിയാക്കാൻ കഴിയാതെ വരുമ്പോൾ പോലീസ് സ്വീകരിക്കേണ്ട നടപടികളെപ്പറ്റി പരാമർശിക്കുന്ന BNSS ലെ സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 58", "സെക്ഷൻ 53", "സെക്ഷൻ 187", "സെക്ഷൻ 174"],
        correct: 2
    },
    {
        question: "പോലീസ് അറസ്റ്റ് ചെയ്യുന്ന ഏതൊരു വ്യക്തിയെയും മെഡിക്കൽ പരിശോധന നടത്തണമെന്ന് നിർദ്ദേശിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 50", "സെക്ഷൻ 58", "സെക്ഷൻ 64", "സെക്ഷൻ 53"],
        correct: 3
    },
    {
        question: "അസാധാരണമായ സാഹചര്യങ്ങളിലൊഴികെ സൂര്യാസ്ത‌മയത്തിനുശേഷമോ സൂര്യോദയത്തിനു മുൻപോ ഒരു സ്ത്രീയെ അറസ്റ്റ് ചെയ്യാൻ പാടില്ലെന്നു നിർദ്ദേശിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 43 (1)", "സെക്ഷൻ 43 (2)", "സെക്ഷൻ 43 (3)", "സെക്ഷൻ 43 (5)"],
        correct: 3
    },
    {
        question: "ചോദ്യം ചെയ്യൽ സമയത്ത് പ്രതിക്കു താൻ തിരഞ്ഞെടുക്കുന്ന ഒരു വക്കീലിനെ കാണാനുള്ള അവകാശത്തെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ് ?",
        options: ["സെക്ഷൻ 40", "സെക്ഷൻ 36", "സെക്ഷൻ 41", "സെക്ഷൻ 38"],
        correct: 3
    },
    {
        question: "ഒരാളെ അറസ്റ്റ് ചെയ്യുമ്പോൾ തയ്യാറാക്കുന്ന മെമ്മോറാണ്ടം ആ വ്യക്തിയുടെ കുടുംബത്തിലെ ഒരംഗമോ, ആ പ്രദേശത്തെ മാന്യനായ ഒരു വ്യക്തിയോ സാക്ഷ്യപ്പെടുത്തണമെന്ന് പ്രതിപാദിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 36", "സെക്ഷൻ 40", "സെക്ഷൻ 38", "സെക്ഷൻ 41"],
        correct: 0
    },
    {
        question: "അറസ്റ്റ് ചെയ്യപ്പെടുന്ന ആളെ അറസ്റ്റിനുള്ള കാരണങ്ങളും ജാമ്യത്തിനുള്ള അവകാശങ്ങളും അറിയിക്കണമെന്നു പ്രതിപാദിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 47", "സെക്ഷൻ 49", "സെക്ഷൻ 51", "സെക്ഷൻ 53"],
        correct: 0
    },
    {
        question: "സമൻസ് ചെയ്യപ്പെടുന്ന ആളെ കണ്ടെത്താൻ കഴിയാതെ വരുമ്പോൾ കുടുംബത്തിലെ മുതിർന്ന പുരുഷ അംഗത്തിനു സമൻസ് കൈമാറാമെന്നു പ്രതിപാദിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 62", "സെക്ഷൻ 66", "സെക്ഷൻ 74", "സെക്ഷൻ 72"],
        correct: 1
    },
    {
        question: "BNSS സെക്ഷൻ 194(3) പ്രകാരം വിവാഹം കഴിഞ്ഞ് .... വർഷത്തിനുള്ളിൽ ഒരു സ്ത്രീ ആത്മഹത്യ ചെയ്ത കേസിൽ മൃതദേഹം പരിശോധനയ്ക്കായി അയച്ച് പോലീസ് റിപ്പോർട്ട് തയ്യാറാക്കണം",
        options: ["3", "5", "7", "10"],
        correct: 2
    },
    {
        question: "യാത്രയിലോ, സമുദ്രയാത്രയിലോ ചെയ്യുന്ന കുറ്റത്തിന്റെ വിചാരണ എങ്ങനെ നടത്തണമെന്നു പ്രതിപാദിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 201", "സെക്ഷൻ 180", "സെക്ഷൻ 198", "സെക്ഷൻ 203"],
        correct: 3
    },
    {
        question: "അന്വേഷണം എന്നതിൻ്റെ നിർവചനം ഉൾക്കൊള്ളുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 2(1)(a)", "സെക്ഷൻ 2(1)(o)", "സെക്ഷൻ 2(1)(l)", "സെക്ഷൻ 2(1)(q)"],
        correct: 2
    },
    {
        question: "BNSS ന് രാഷ്ട്രപതിയുടെ അംഗീകാരം ലഭിച്ചത് ?",
        options: ["2023 ഡിസംബർ 25", "2023 ഡിസംബർ 12", "2023 ഡിസംബർ 21", "2023 ഡിസംബർ 24"],
        correct: 0
    },
    {
        question: "വാറണ്ട് കേസ് എന്നതിൻ്റെ നിർവചനം ഉൾക്കൊള്ളുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 4", "സെക്ഷൻ 2(1)(z)", "സെക്ഷൻ 2(1)", "സെക്ഷൻ 2(q)"],
        correct: 1
    },
    {
        question: "ഒരു സ്വകാര്യ വ്യക്തിയ്ക്ക് ഒരു പ്രതിയെ അറസ്റ്റ് ചെയ്യാമെന്നും അങ്ങനെ അറസ്റ്റ് ചെയ്‌താലുള്ള നടപടി ക്രമത്തിനെക്കുറിച്ചും പ്രതിപാദിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 40", "സെക്ഷൻ 41", "സെക്ഷൻ 47", "സെക്ഷൻ 43"],
        correct: 0
    },
    {
        question: "അറസ്റ്റ് ചെയ്യപ്പെടുന്ന ആളുടെ ദേഹപരിശോധനയെക്കുറിച്ചു പ്രതിപാദിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 58", "സെക്ഷൻ 51", "സെക്ഷൻ 53", "സെക്ഷൻ 49"],
        correct: 3
    },
    {
        question: "കൃത്യം ചെയ്യുന്ന സ്ഥലത്തോ അനന്തരഫലം ഉണ്ടാകുന്ന സ്ഥലത്തോ കുറ്റം വിചാരണ ചെയ്യാം എന്നു പ്രതിപാദിക്കുന്ന BNSS സെക്ഷൻ ഏതാണ്?",
        options: ["സെക്ഷൻ 180", "സെക്ഷൻ 199", "സെക്ഷൻ 197", "സെക്ഷൻ 200"],
        correct: 1
    },
    {
        question: "BNSS വകുപ്പുകൾ 168-172 പ്രകാരമുള്ള നടപടികളുടെ പ്രധാന ലക്ഷ്യം എന്താണ്?",
        options: ["കോടതിയുടെ അധികാരങ്ങൾ കുറയ്ക്കുക", "കുറ്റകൃത്യം സംഭവിക്കാതെ തടയുക", "ജാമ്യം നിഷേധിക്കാൻ വഴി ഒരുക്കുക", "വാറണ്ട് ഇല്ലാതെ അറസ്റ്റ് സാധ്യമാവുക"],
        correct: 1
    },
    {
        question: "(BNSS) പ്രകാരം പോലീസ് എഫ്.ഐ.ആർ രജിസ്റ്റർ ചെയ്യേണ്ടത് എത്ര സമയത്തിനുള്ളിൽ ?",
        options: ["7 ദിവസത്തിനുള്ളിൽ", "ഉടൻ തന്നെ", "24 മണിക്കൂറിനുള്ളിൽ", "മേധാവിയുടെ അനുമതിക്കുശേഷം"],
        correct: 1
    }
];
